# ElementsAlreadyDisplacedInView Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
BuiltInFailures..::..DisplacementElementFailures..::..ElementsAlreadyDisplacedInView Property
BuiltInFailures..::..DisplacementElementFailures Class See Also
---
A Displacement Set can only be pasted into a 3D view in which none of its sub-elements is already a sub-element of another Displacement Set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementsAlreadyDisplacedInView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementsAlreadyDisplacedInView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementsAlreadyDisplacedInView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DisplacementElementFailures Class
Autodesk.Revit.DB Namespace